{"modelTopology":{"class_name":"Sequential","config":{"name":"Doodle Jump Bot","layers":[{"class_name":"Dense","config":{"units":4,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Hidden_layer","trainable":true,"batch_input_shape":[null,5],"dtype":"float32"}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Output_layer","trainable":true}}]},"keras_version":"tfjs-layers 2.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.7.0","convertedBy":null,"weightsManifest":[{"paths":["./best-doodler.weights.bin"],"weights":[{"name":"Hidden_layer/kernel","shape":[5,4],"dtype":"float32"},{"name":"Hidden_layer/bias","shape":[4],"dtype":"float32"},{"name":"Output_layer/kernel","shape":[4,3],"dtype":"float32"},{"name":"Output_layer/bias","shape":[3],"dtype":"float32"}]}]}